0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 2.581755593803787e+02;

boundaryField
{ 
    Inflow
    {
        type            fixedValue;
        value           uniform 300;
    }

    Outflow
    {
        type            zeroGradient;
    }

    Back
    {
        type            symmetry;
    }

    BottomWall
    {
        type            zeroGradient;
    }

    Front
    {
        type            symmetry;
    }

    UpperWall
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
