0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    Inflow
    {
        type            fixedValue;
        value           uniform (2.898711803626212e+02 0 0);
    }

    Outflow
    {
        type            zeroGradient;
    }

    Back
    {
        type            symmetry;
    }

    BottomWall
    {
        type            zeroGradient;
    }

    Front
    {
        type            symmetry;
    }

    UpperWall
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
