0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 3.007918654273306e-05;

boundaryField
{
    Inflow
    {
        type            fixedValue;  //calculated;
        value           $internalField;
    }

    Outflow
    {
       type            zeroGradient; //calculated;
       //value           $internalField;
    }

    Back
    {
        type            symmetry;
    }

    BottomWall
    {
        type            zeroGradient;  //calculated;        
        //value           $internalField;
    }

    Front
    {
        type            symmetry;
    }

    UpperWall
    {
        type            zeroGradient;  //calculated;
        //value           $internalField;
    }
}

// ************************************************************************* //
