constant/polyMesh/boundary
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}

6         
(
    Back
    {
        type symmetry;
        nFaces 29852;
        startFace 56350;
    }

    BottomWall
    {
        type wall;
        nFaces 299;
        startFace 86202;
    }

    Front
    {
        type symmetry;
        nFaces 29852;
        startFace 86501;
    }

    Inflow
    {
        type patch;
        nFaces 89;
        startFace 116353;
    }

    Outflow
    {
        type patch;
        nFaces 89;
        startFace 116442;
    }

    UpperWall
    {
        type wall;
        nFaces 299;
        startFace 116531;
    }
)
