system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             rhoEnergyFoam;

startFrom               latestTime;

startTime               0;

stopAt                  endTime;

endTime                 1;

deltaT                  5e-8;

writeControl            adjustableRunTime;

writeInterval           1e-6;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

timeFormat              general;

timePrecision           6;

runTimeModifiable       true;

//adjustTimeStep        no;

maxCo                   0.6;

maxDeltaT               1.0;

pressArtDiff            true; //activate artificial diffusion on pressure
convArtDiff             true; //activate artificial diffusion on convective terms

ducLevelPress           0.00;
ducLevelConv            0.05;
epsilon                 4.8216e+03; //velocity^2 / reference length
kp                      0.25;
ku                      0.75;
rm                      0.2;
minfty                  0.04;

functions
{
        writeduc
        {
                type                    writeObjects;
                libs                    ( "libutilityFunctionObjects.so" );
                objects                 ( "ducSensor" );
                writeControl            outputTime;
                writeInterval           1;
        }

        pressure1
        {
                type                    pressure;
                libs                    (fieldFunctionObjects);
                writeControl            writeTime;
                mode                    staticCoeff;
                rho                     rhoInf;
                rhoInf                  1.1740;
                U                       UInf;
                UInf                    (69.437 0 0);
                pInf                    10108;
                patches                 (my-wall);
        }
/*
        forceCoeffs
        {
                type                    forceCoeffs;
                libs                    ( forces );
                writeControl            writeTime;
                rho                     rhoInf;
                rhoInf                  1.3318;
                liftDir                 (0 1 0);
                dragDir                 (1 0 0);
                CofR                    (0.5 0 0);
                pitchAxis               (0 0 1);
                magUInf                 291.;
                lRef                    1;
                Aref                    5.715; // mesh span = 0.6, bump height = 9.525
                patches                 (my-wall);
        }
*/
        wallShearStress
        {
                type                    wallShearStress;
                libs                    ( fieldFunctionObjects );
                writeControl            writeTime;
                patches                 (my-wall);
        }

        yPlus
        {
                type                    yPlus;
                libs                    ( fieldFunctionObjects );
                writeControl            writeTime;
                patches                 (my-wall);
        }
/*
        SampleDict
        {
                type                    sets;
                libs                    (sampling);
                writeControl            outputTime;
                writeInterval           1;
                interpolationScheme     cellPointFace;
                setFormat               raw;
                sets
                (
                        x02neg
                        {
                                type            face; //midPoint; //uniform;
                                axis            z;
                                start           (1.0 -0.5  0.0 );
                                end             (1.0 -0.5  0.05);

                        //nPoints         440;
                                interpolate     true;
                        }
                );
                fields          (U rho p T thermo:mu);
        }


        SampleU
        {
                type                    sets;
                libs                    (sampling);
                writeControl            outputTime;
                writeInterval           1;
                interpolationScheme     cell;
                setFormat               raw;
                sets
                (
                        x02neg
			{
         			type            uniform;
                                axis            y;
                                start           (-0.2 0.0761884 0.0);
                                end             (-0.2 0.812676  0.0);
                                nPoints         400;
                                interpolate     true;
                        }
                );
                fields          (U grad(U) rho T);
        }

        Cp
        {
                type                    sets;
                writeControl            writeTime;
                interpolationScheme     cellPointFace;
                setFormat               raw;

                sets
                (
                        profile
                        {

                                type            uniform;
                                axis            x;
                                start           (-0.1  0.09523549296 0.0);
                                end             ( 0.32 0.09523549296 0.0);
                                nPoints         250;
                                patches         ("my-wall");
                                interpolate     false;
                        }
                );

                fields          ( p );
        }
*/

}

// ************************************************************************* //
